{"layout": "post", "title": "Node.js Exercise", "published": "Apr 20, 2021", "author": "yonatanBenezra", "tags": "node, js, javascript", "timestamp": 1618921834, "location": "nodejs.md.json", "content": "Here you will have a couple of mini projects to exercise Node.js.\nthe big project will be after learning express.\n\n**1**\nCreate three files: \n1. utils.js\n2. handler.js\n3. questions.js\n\nInside of utils.js, export all three of these variables using a single object:\n\n```javascript\nconst MONEY = \"money\"\nconst LIFE = \"life\"\nconst FREEWILL = \"freewill\"\n```\n\nInside of handler.js, write a single function called handleQuestion\n\nThis function receives a single parameter called question: an object with two keys\ntext - some string\ntype - a string with either \"money\", \"life\", or \"freewill\" as the value\nIf the question type is...\n\n\"money\", the function should print \"how does the social construction of money work?\"\n\"life\", the function should print \"What does it mean to live a good life?\"\n\"freewill\", the function should print \"Is free will real or just an illusion?\"\nThis function should use the MONEY, LIFE, and FREEWILL properties from the utils module\nIn other words, you should not hard-code: if(question.type === \"money\")\n\nOf course, this means you will have to require the utils module inside of handler\n\nFinally, in questions.js, make the following code work:\n\n```javascript\nlet question1 = {\n    text: \"How do I get more money?\",\n    type: //use the FINANCE type from the utils module\n}\n\nlet question2 = {\n    text: \"How much money do I need?\",\n    type: //use the FINANCE type from the utils module\n}\n\nlet question3 = {\n    text: \"To be free or not to be?\",\n    type: //use the FREEWILL type from the utils module\n}\n\nhandleQuestion(question1) //should print \"how does the social construction of money work?\"\nhandleQuestion(question2) //should print \"how does the social construction of money work?\"\nhandleQuestion(question3) //should print \"Is free will real or just an illusion?\"\n```\n\nFor this to work you'll need a couple of imports - but remember, you can only require a module that's been exported!"}