{"layout": "post", "title": "html", "published": "Oct 18, 2021", "author": "yonatan119", "tags": "html", "timestamp": 1634563834, "location": "html.md.json", "content": "# *html*\n\n*Nodes and elements*\n\neverything inside of HTML is a node, for example: comments, text and elements.\n\nAn element is made up of an \"opening tag\" and a \"closing tag\". for example: a \"paragraph\" tag will use the \"p\" element.\n\n```javascript\n<p>here will be the text inside of this paragraph.</p>\n```\nso we have an opening tag of a \"p\" element, text which is a node and a closing tag.\n\nHow many elements are in the code below? What are their tags?\n\n```javascript\n<div>\n  <h2>I am a header</h2>\n  <p>its cosy here inside of a div</p>\n</div>\n```\n\nHighlight over the colored text below for the answer:\n\n> There are 3 elements: A \"div\", and inside of it an \"h1\" element and next to it a \"p\" element.\n\n*Structure*\n\nThanks to HTML elements, we can control the layout of a webpage.\n\nlets try it out!\ncopy this block of code inside your html file and see how it looks.\n\n```javascript\n<h1>h1 is the largest sized headin</h1>\n<p>this is a \"p\" element, mostly it will contain long text</p>\n\n<h2>this is an h2</h2>\n<p>this is a sub-heading about the sizes of headings. the largest heading element is h1, as the number of the heading is bigger, the size of the font is smaller</p>\n\n<h3>for instance, this is an h3</h3>\n<p>cool.</p>\n```\n\n*block elements*\n the elements we used above are block elements, which means they\n take up the entire width of their parent element\n each of these elements is a child of the body element.\n the width of the body element is the whole page, so the width of all its children are the whole page too!\n\n*inline elements*\n\ninline elements only take up as much space as they need.\nlets see an example of an inline element.\n\ncopy this text to your body and pay attention to the width of the span element\n\n```javascript\n<p>I take up all the width of my parent<span>I take up space only as much as needed because im an inline element.</span></p>\n```\n\n# *attributes*\n\nwe can give each element a specific attribute, like an id:\n\n```javascript\n<p id=\"title\">presentense</p>\n```\n\nWe added an ID attribute to a \"p\" element inside of the opening tag, which lets us identify each element. this doesn't not change anything about the element, but some attributes can change the functionality or affect or the element, some even require certain attributes.\n\nanother common identifier attribute is class.\nthe difference about the two is:\nthe same Class can be given to more then one element, and each element can be given more than one class.\nsomething that can not happen with the ID attribute.\n(there can not be more than one element with the same and each element)\n\nTo give an element more than one class, just separate them with a space, like so:\n\n```javascript\n<p class=\"paragraph element\">my classes are \"paragraph\" and \"element\"</p>\n```\n\nlets talk about some other tags.\n\n*img tag*\n\nthe img (image) tag is one of those elements who require a certain attribute,\nto show an image we need to enter the image link inside of a \"src\" attribute like this: \n\n<img src=\"https://pbs.twimg.com/profile_images/821849411991044096/lQFa_Vly.jpg\"/>\n\nnotice anything strange?\nthis element does not have a closing tag!\nmost of the elements don't really need a closing tag, so thats cool.\n\n*a tag*\n\nAn a tag is used for linking.\nit needs an \"href\" attribute with the link url.\nwe can use the a tag for linking \n To do so, we use an href attribute like the following:\n\n```javascript\n<a href=\"http://www.google.com\">Click Here for Google!</a>\n```\n\nlets use this \"a\" tag to scroll between sections on the page.\n\nfirst: we will copy this code to our body at the top of the page\n\n```javascript\n<div id=\"top\">Top</div>\n```\n\nthen enter a \"div\" tag with enough text to fill the page and on the bottom copy this code:\n\n```javascript\n<a href=\"#top\">To Top</a>\n```\n\nonce we click on the \"a\" tag it will send us to the \"div\" with an id of \"top\".\n\nmake sure the page has somewhere to scroll, if it is too small this excersice wont work.\n\n# *important notes*\n\n1. to call a class we write the class name with a dot beforehand.\n2. to call an id we write the class name with a \"#\" beforehand.\n\nwe will use these mostly in css or with inner site \"a\" tags. \n\n\n# *HTML tags list*\n\nFor now, the most useful tags will be:\n- [div](#div)\n  * [h1-h6](#h1-h6)\n  * [p](#p)\n  * [ul/ol&li](#ul/ol&li)\n  * [input](#input)\n  * [button](#button)\n\n\n# div\n\nThe div tag is a block element,\nit will help us organize elements on the page and style them later on with CSS.\n\nwe can nest any element within a div, go ahead and try!\n\n```javascript\n<div>\n\n <div>nested div</div>\n\n <span>nested span</span>\n\n <p>nested p</p>\n\n</div> \n```\n\nnesting elements will help us better style our our elements!\n\n# *headers*\n\nThe h tag is a block element.\n\nthey let us display text in different sizes in an easy way.\n\n# *p*\n\nThe p tag is a block element,\nThey should not contain any other element nested in them or anything besides text.\n\n# *lists*\n\nul: unordered list\nol: ordered list\nli: list item\n\nwe nest the li tag inside either an ol tag or a ul tag.\n\nlike this:\n\n<ol>\n\n\t<li>Presentense</li>\n\n\t<li>Haratzif</li>\n\n\t<li>ARDC</li>\n\n</ol>\n\n\n# *input*\n\nWe use inputs to input data that we can later use.\n\nthere are two important attributes that we will talk about.\n\n1. placeholder - a text which will display before the user types inside.\n\n2. type - the type of input allowed for the use, it can be text, number...\n\n# *button*\n\nthe button tag will render a pre-styled button that will all the user to interact with our page.\nfor example:\n\n```javascript\n<button>buy</button>\n```\n\nthis does not do anything right now because we didn't add any logic."}