{"layout": "post", "title": "HTTP and Request/response cycle", "published": "Apr 27, 2021", "author": "yonatan119", "tags": "https, request response cycle", "timestamp": 1619526634, "location": "http.md.json", "content": "# **Http**\n*What is HTTP*\n- HTTP stands for Hypertext Transfer Protocol.\n- Hypertext Transfer Protocol is a set of rule which is used for transferring the files like, audio, video, graphic image, text and other multimedia files on the WWW (World Wide Web).\n- HTTP is an application-level protocol.   \nThe communication usually takes place through TCP/IP sockets, but any reliable transport can also be used.\n- HTTP is used to make communication between a variety of hosts and clients.   \nIt supports a mixture of network configuration.\n- HTTP is a protocol that is used to transfer the hypertext from the client end to the server end, but HTTP does not have any security.\n- Whenever a user opens their Web Browser, that means the user indirectly uses HTTP.\n___\n**Three important things about HTTP**\n\n1. **Connectionless**: HTTP is connectionless, When the HTTP client opens the browser, the browser initiates an HTTP request.   \nAfter making the request, the client disconnect from the server and wait for the response.   \nWhen the response is ready, the server re-establish the connection again and delivers the response to the client, after which the client disconnects the connection.   \nSo both client and server know about each other during the current request and response only.\n\n2. **Media Independent:** HTTP is media independent, HTTP can deliver any sort of data, as long as the two computers can read it.\n\n3. **Stateless:** The HTTP is stateless, The client and server just know about each other just during the current request.   \nIf the connection is closed, and two computers want to connect again, they need to provide information to each other anew, and the connection is handled as the very first one.\n___\n**What is HTTPS**\n- HTTPS stands for Hypertext Transfer Protocol Secure, HTTPS has a secure transfer.\n- HTTPS is used to encrypt or decrypt user HTTP page or HTTP page requests that are returned by the webserver.\n- Using the HTTPS, sensitive information that we want to transfer from one user to another user can be done securely.\n- HTTPS protocol uses HTTP on connection encrypted by SSL (Secure Socket Layer) or TLS (Transport Layer Security).\n- HTTPS protects transmitted data from man-in-the-middle (MITM) attacks and eavesdropping.\n- It is the default protocol for conduction financial transactions on the web.\n\nto learn more about HTTP enter [this link](https://www.javatpoint.com/http-tutorial)\n___\n# **HTTP Request/response cycle**\nThe web is a cycle of requests and responses that flow between clients and servers.   \nLets go over basic understandings before diving in.\n![](https://content.codecademy.com/projects/3/request-response-cycle-static.svg)\n___\n**What is a client?**\nA client is a piece of computer hardware or software that accesses a service made available by a server.   \nGenerally, clients are web browsers (like Chrome or Firefox), but clients can also be API’s making requests to another server or the command line (when making cURL requests).\n___\n**What is an HTTP request?**\nAמ HTTP request is a text string generated by the client and sent to the server containing the specifications of the resource the client is asking for.   \nA resource is anything that can accessed via the web, the HTTP request communicates which resource a client wants to interact with and how the client wants to interact with it, along with some metadata held in the header related to the request.   \nThe resource the client wants to interact with is communicated through the URL that is sent with the request.   \nFor example, if a user entered http://twitter.com into their web browser, the web browser would send a request to the server looking for the Twitter resource.   \n___\n**What are the different types of request methods that can be included in an HTTP request?**\nHow the user wants to interact with the resource is communicated through the request method.   \nFour of the most common request methods are \n- GET\n- POST\n- PUT\n- DELETE\n\n- GET requests generally ask for the resource to be returned unchanged.   \nSending a request to the homepage of Twitter would be a GET request.\n\n- POST requests are used to make a submission to the resource.   \nThis type of request would typically ask the server to store new information, for example by writing it to a database.   \nPosting a new tweet would be an example of a POST request.\n\n- PUT requests are used to update a resource.   \nEditing a tweet would be an example of a PUT request.\n\n- DELETE requests are used to remove a resource.    \nFor example, deleting a tweet would be an example of a DELETE request.\n___\n**What is an HTTP response?**\nAn HTTP response is what is sent by a server to a client in response to an HTTP request.   \nThese responses contain a status code and if the request was successful, the requested resource.   \nAn example status code for a successful request would be “200” and an example status code for an unsuccessful request would be “404”.   \nOther common status codes include “300” for redirects and “500” for server errors.\n___\n**Github’s 404 page when making an invalid request**\nHTTP responses also include a message body.   \nIf the client is a browser, the HTML body is generally an HTML page that the browser can then render.   \nIf the client is an API or Command Line, the message body could be a JSON or XML steam.   \nAn HTTP response would also contain a header with metadata related to the response, similar to an HTTP request header.\n___\n**How does the server know what to respond with?**\nAll resources are hosted on a server.   \nThe server’s location on the web can be identified by its IP address, however, IP addresses aren’t particularly user friendly, and instead we use URLS (such as http://www.google.co.il) to search for a resource.   \nOnce the client’s request has reached the server, the server will search for and return the information the client is requesting.   \nOften times, this means querying a database, loading the information into an html page, and returning the HTML text to the user in the body of the HTTP response.   \n___\n**What happens once the client receives the HTTP response back from the server?**\nOnce the client receives the HTTP response, the browser will render the HTTP response body message.   \nThis message is either the requested resource (for example, a web page) or display a message relating to status code if the request wasn’t successful."}