{"layout": "post", "title": "JSON and API's", "published": "Apr 27, 2021", "author": "yonatan119", "tags": "JSON and API's", "timestamp": 1619526634, "location": "json&apis copy.md.json", "content": "# **Json**\nJSON stands for JavaScript Object Notation.   \nJSON objects are used for transferring data between server and client, XML serves the same purpose.   \nHowever JSON objects have several advantages over XML and we are going to discuss them in this lesson along with JSON concepts and its usages.\n\nThis is how JSON data will look: It basically has key-value pairs.\n```json\nvar chaitanya = {\n   \"firstName\" : \"Chaitanya\",\n   \"lastName\" : \"Singh\",\n   \"age\" :  \"28\"\n};\n```\n___\n**Features of JSON:**\n- It is light-weight\n- It is language independent\n- Easy to read and write\n- Text based, human readable data exchange format\n___\n**Why use JSON?**\nStandard Structure: As we have seen so far that JSON objects are having a standard structure that makes our job easy to read and write code. \n\n- **Light weight:** When requesting data from an external server/data storage, it is important to load the data quickly and asynchronously(we will understand what this is further on) without requesting the page re-load. Since JSON is light weighted, it becomes easier to get and load the requested data quickly.\n\n- **Scalable:** JSON is language independent, which means it can work well with most of the modern programming language.   \nLet’s say if we need to change the server side language, in that case it would be easier for us to go ahead with that change as JSON structure is same for all the languages.\n___\n**JSON vs. XML**\nLet see how JSON and [XML](https://www.w3schools.com/xml/xml_whatis.asp(similiar to html) look when we store the records of 4 students in a text based format so that we can retrieve it later when required.\n\nJSON style:\n```json\n{\"students\":[\n   {\"name\":\"John\", \"age\":\"23\", \"city\":\"Agra\"},\n   {\"name\":\"Steve\", \"age\":\"28\", \"city\":\"Delhi\"},\n   {\"name\":\"Peter\", \"age\":\"32\", \"city\":\"Chennai\"},\n   {\"name\":\"Chaitanya\", \"age\":\"28\", \"city\":\"Bangalore\"}\n]}\n```\nXML style:\n```xml\n<students>\n  <student>\n    <name>John</name> <age>23</age> <city>Agra</city>\n  </student>\n  <student>\n    <name>Steve</name> <age>28</age> <city>Delhi</city>\n  </student>\n  <student>\n    <name>Peter</name> <age>32</age> <city>Chennai</city>\n  </student>\n  <student>\n    <name>Chaitanya</name> <age>28</age> <city>Bangalore</city>\n  </student>\n</students>\n```\nAs you can clearly see JSON is much more **light-weight** compared to XML. Also, in JSON we take advantage of arrays that is not available in XML.\n___\n**JSON data structure types and how to read them:**\n- JSON objects\n- JSON objects in array\n- Nesting of JSON objects\n\n1. JSON objects:\n```javascript\nconst chaitanya = {\n  \"name\" : \"Chaitanya Singh\",\n  \"age\" : \"28\",\n  \"website\" : \"beginnersbook\"\n};\n```\nThe above text creates an object that we can access using the variable chaitanya.   \nInside an object we can have any number of key-value pairs like we have above.   \nWe can access the information out of a JSON object like this:\n```json\ndocument.writeln(\"The name is:  \" +chaitanya.name);\ndocument.writeln(\"his age is: \" + chaitanya.age);\ndocument.writeln(\"his website is: \"+ chaitanya.website);\n```\n___\n**2. JSON objects in array**\nIn the above example we have stored the information of one person in a JSON object suppose we want to store the information of more than one person; in that case we can have an array of objects.\n```json\nvar students = [{\n   \"name\" : \"Steve\",\n   \"age\" :  \"29\",\n   \"gender\" : \"male\"\n\n},\n{\n   \"name\" : \"Peter\",\n   \"age\" : \"32\",\n   \"gender\" : \"male\"\n\n},\n{\n   \"name\" : \"Sophie\",\n   \"age\" : \"27\",\n   \"gender\" : \"female\"\n}];\n```\nTo access the information out of this array, we will write the code like this:\n```javascript\ndocument.writeln(students[0].age); //output would be: 29\ndocument.writeln(students[2].name); //output: Sophie\n```\n___\n**3. Nesting of JSON objects:**\nAnother way of doing the same thing that we have done above.\n```javascript\nvar students = {\n  \"steve\" : {\n  \"name\" : \"Steve\",\n  \"age\" :  \"29\",\n  \"gender\" : \"male\" \n},\n\n\"pete\" : {\n  \"name\" : \"Peter\",\n  \"age\" : \"32\",\n  \"gender\" : \"male\"\n},\n\n\"sop\" : {\n  \"name\" : \"Sophie\",\n  \"age\" : \"27\",\n  \"gender\" : \"female\"\n}\n}\n```\nif you want to access the info from above nested JSON objects:\n```javascript\ndocument.writln(students.steve.age); //output: 29\ndocument.writeln(students.sop.gender); //output: female\n```\n**JSON & JavaScript:**\nJSON is considered as a subset of JavaScript but that does not mean that JSON cannot be used with other languages.   \nIn fact it works well with PHP, Perl, Python, Ruby, Java, Ajax and many more.\n\nJust to demonstrate how JSON can be used along with JavaScript, here is an example:\nIf you have gone through the above examples, you are familiar with the JSON structures. A JSON file type is .json\n___\n**How to read data from json file and convert it into a JavaScript object?**\nWe can do this using JSON parser, Here is how to use it:\n```javascript\nvar chaitanya = {\n\"name\" : \"Chaitanya Singh\",\n\"age\" : \"28\",\n\"website\" : \"beginnersbook\"\n};\n```\nWe will converting the above JSON object to javascript object using JSON parser:\n```javascript\nvar myJSObject = JSON.parse(chaitanya);\nHow to convert JavaScript object to JSON text?\nBy using method stringify\n\nvar jsonText= JSON.stringify(myJSObject);\n```\n___\n**JSON rules and notes**\nIn JSON, values must be one of the following data types:\n\n- a string\n- a number\n- an object (JSON object)\n- an array\n- a boolean\n- null\n\nIn JSON, string values must be written with double quotes:   \nLike this:\n```json\n{ \"name\":\"John\" }\n```\nto read more about json enter this link [W3Schools-Json](https://www.w3schools.com/js/js_json_intro.asp)\nand learn the pages from **JSON** Intro up to **JSON HTML**.\nfor exercises enter [this link](http://www.steves-internet-guide.com/json-for-beginners/)\n___\n# **Api**\n\n**What is an API and How Do They Work?**\n*all examples and apis are taken from rapidapi.com*\nIn the process of improving your applications, you will eventually come across a term like API.   \nAPI stands for **Application Programming Interface**.\n\nAPI is like an open language, the rules of which are shared by a certain service.\nYou can teach your application the rules of this language, so it can communicate with the service and access all the functions and data that the service is ready to share.   \nSpeaking a little more formally, API is an interface that allows your application to interact with an external service using a simple set of commands.   \nYou do not need to know the internal logic of the service, just send a simple command and the service will return the necessary data.\n\n*For example*, if you need to contact the [news aggregator API](https://rapidapi.com/blog/rapidapi-featured-news-apis/) and get ten of today’s most popular news from it, you refer to the “topnews” command (which the service described in advance in the public domain), and in response, the service will send you the latest collection of sensations.\n___\n**Why are APIs important?**\nIf there were no APIs, the functionality of your applications would be limited, and the development time would increase significantly since any function that is not implemented as a module of one of the programming languages would have to be developed independently.     \nIf there were no API, each application would be limited to a narrow list of its own functions without the possibility of expanding it to something that others have already invented and used for a long time.\n___\n**Benefits of APIs**\nAPIs allow you to save time when developing and help not to invent a bicycle.   \nIt is much more efficient and more convenient to use the capabilities of one of the APIs than to try to independently implement similar functionality.   \nMoreover, it will be problematic to get some functions and data other than through the API (for example, a [weather forecast](https://rapidapi.com/blog/access-global-weather-data-with-these-weather-apis/), a thematic selection of news or a high-quality translation from almost any language).   \n\n**Types of APIs**\nThere are four main types of APIs:\n\n- **Open APIs**: Also known as Public APIs, there are no restrictions to access these types of APIs because they are publicly available.   \n- **Partner APIs**: One needs specific rights or licenses in order to access this type of APIs because they are not available to the public.   \n- **Internal APIs**: Also known as Private APIs, only internal systems expose this type of API, which is, therefore, less known and often meant to be used inside the company. The company uses this type of API among the different internal teams to be able to improve its products and services.   \n- **Composite APIs**: This type of API combines different data and service APIs. It is a sequence of tasks that run synchronously as a result of the execution and not at the request of a task. Its main uses are to speed up the process of execution and improve the performance of the listeners in the web interfaces.   \nYou can read more about API types here: [Types of API](https://rapidapi.com/blog/types-of-apis/)\n\nAPI Example\nAn API specification can take many forms, but often includes specifications for routines, data structures, object classes, variables, or remote calls. POSIX, Windows API and ASPI are examples of different forms of APIs. – Wikipedia\n___\n**Endpoints**\nEndpoints are the key elements in the interaction of your application with the API. Usually, it is a specific address (for example, https://newssite.com/topnews), by referring to which you get access to certain features/functions (in our case – a list of top news).\nCommonly, the name (address) of the endpoint corresponds to the functionality it provides.\n\nto learn more about Api, which is highly recommended, see [this](https://www.w3schools.com/js/js_api_intro.asp) and go through the lessons from *Web API Intro* to *Web Geolocation API*\n___"}