{"layout": "post", "title": "Learning Lesson", "published": "Jun 20, 2021", "author": "yonatan119", "tags": "Learning, How to learn alone", "timestamp": 1624206634, "location": "learning-lesson.md.json", "content": "**How to learn by yourself**   \nThe first thing you need to make sure is.\n1. that you have google chrome downloaded, and that is the browser you use.\n2. your search engine is `Google.com`.\n3. clean your desktop and browser tabs, it helps concentrate.\n___\nLet's start with what \"learning by yourself means\".\nThere is actually a word for this, and it is called audodidact or Autodidacticism.   \n\nBy wikipedia the meaning is:\n\"Autodidacticism or self-education is education without the guidance of masters or institutions. Generally, autodidacts are individuals who choose the subject they will study, their studying material, and the studying rhythm and time.\"\n___\nSome important concepts for learning:\n\n1. <b>The mind needs exercise and repetition over time in order to fully understand a concept.</b>   \nThis means:\n    - When you first read or hear something new, it is normal that you do not fully understand it.\n\n    - Read it more than once and look at examples.\n\n    - Try it yourself.\n\n    - At a later time, get back to the same concept and either read it again and try it again or try to learn it from a different source and do different exercise. Repetition is very powerful.\n\n2. <b>Breakdown</b>   \nIt is difficult to fully understand a large concept.\n\nThe best way to do it is:   \n- Learn it in parts   \n- break it into pieces   \n- learn gradually   \n- Exercise part 1 of the concept   then part 2, then if possible exercise the combination of both.\n\n3. <b>With time, learn what works best for you.</b>\nSome of us like to read the material in English, some like to search for training in their native language.   \nSome prefer training Videos, others like face-to-face.   \nSome like to study alone, others prefer studying a group. \n<b>Learn what works for you and utilize it.</b>\n\n4. <b>Recognize your own improvement</b>   \n\"We tend to take for granted things that are easy for us and fear things we don't know or don't understand.\"\n\nwhen approaching a problem start with what you can solve and the circle back to the ones that you don't know.\n\nThe process of learning simplified is\n- Take something you don't know\n- do what is needed in order to study it\n- then identify the next thing you don't know and do the same.\n\nAt times we need to reflect and see that we now know x,y and z, possibly they are also easy and clear for us, and that we didn't understand them as well a while ago.\n<br/>\nThis understanding will give us the confidence when we approach the next thing.\n\n5. <b>How to tell a good source on the web vs a bad one?</b>   \nWe have a lesson about this but lets go over it.\n- Make sure the answer is for the specific technology you are using.\n- Read it, go through the answer and check if it makes sense to you.\n- Use known sites. \n- Pay attention to key words\nHow can I tell which Stackoverflow answer is a good one?\n- Check the comments to see if it helped other people.\n- Pay attention to key words.\n- Understand what is written.\n\n6. <b>What do I do if I find an answer but don't recognize the library being used?</b>\ndon't get stuck when you see a library you don't recognize.\n<br/>\nGo ahead and look it up (also go down the rabbit whole you learn alot that way) \n\n7. <b> Google.</b>   \nIf you know how to find the answers, you wont struggle to remember.   \nLearning how to Google is a huge skill and you improve it with time, so search, search, search.\n___\nNow lets talk about How we start learning.   \nHere are a couple of steps suggested to go through when learning something new for a project.\n1. Understand what the project needs and basically what the project is supposed to do.   \n\n2. Go through all the material learned in the class, because getting straight to the project can be hard.\n\n3. Open a relevant cheat sheet or helping material.\n\n4. Star with what you can handle, keep on from there.\n\n5. having a hard time? google it.\n\n6. still having a hard time? contact your mentor :)\n\n7. If you feel you just don't understand, move to something you do understand and get back to it later on.\n\nIf there is one tip I think is best to remember, it is:   \n<b>Start learning!</b>   \nstart by reading guides and tutorials, do a course on the material you want to learn or watch a youtube video.   \nbut most importantly, <b>Start</b>. :)\n\nLearning by yourself is not easy, don't have a hard time if you don't succeed right away.\n\n**Good luck**"}